# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 1.33  # model depth multiple
width_multiple: 1.25  # layer channel multiple
depth_multiple_2: 0.33  # motion stream depth multiple
width_multiple_2: 0.50  # motion stream width multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, DoNothing,[0]],  # Just passes image on next layer
   [-1, 1, Split, [0]],
   [-1, 1, Conv, [64,6,2,2]],  # 2-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 3-P2/4
   [-1, 4, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 5-P3/8
   [-1, 8, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 7-P4/16
   [-1, 12, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 9-P5/32
   [-1, 4, C3, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 11
#neck:
   [-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 8], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 15
 
   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 19 (P3/8-small)
 
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 16], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 22 (P4/16-medium)
 
   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 12], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 25 (P5/32-large)
  ]

head:
  #motion
  [[0,  1, Split, [1]],
   [-1, 1, Conv, [64,6,2,2]],  # 27-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 28-P2/4
   [-1, 1, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 30-P3/8
   [-1, 2, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 32-P4/16
   [-1, 3, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 34-P5/32
   [-1, 1, C3, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 36
   #head
   [[19,31], 1, Concat, [1]], 
   [-1, 1, Conv, [512, 3, 2]], #38
   [[22,33], 1, Concat, [1]], 
   [-1, 1, Conv, [512, 3, 2]], #40
   [[25,36], 1, Concat, [1]], 
   [-1, 1, Conv, [512, 3, 2]], #42
   [[38,40,42], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
  
